### Configuración de pandsas y su importación

In [2]:
# Instalar pandas
#!pip install pandas
import pandas as pd

### Crear una serie a partir de una lista

In [4]:
carros = ['Challenger', 'Toyota', 'Mazda', 'KIA', 'Mitsubishi', 'Ferrari']
carros

['Challenger', 'Toyota', 'Mazda', 'KIA', 'Mitsubishi', 'Ferrari']

In [5]:
# Crear una serie
pd.Series(carros)

0    Challenger
1        Toyota
2         Mazda
3           KIA
4    Mitsubishi
5       Ferrari
dtype: object

### Crear un DataFrame a partir de una lista de diccionarios (JSON)

In [9]:
datos = [
    {"Nombre": 'Jetta Variant', "Motor": 'Motor 4.0 Turbo', "Year": 2020, "Kilometraje": 44410.0, "Cero_km": False, "Valor": 120000},
    {"Nombre": 'Camaro', "Motor": 'Motor 4.54 LS', "Year": 2022, "Kilometraje": 12000.0, "Cero_km": False, "Valor": 480000},
    {"Nombre": 'Challenger', "Motor": 'Motor Turbo 4.3', "Year": 2025, "Kilometraje": 0.0, "Cero_km": True, "Valor": 680000},
    {"Nombre": 'Audio 8 spider', "Motor": 'Motor 8.0 Turbo', "Year": 2032, "Kilometraje": 0.0, "Cero_km": True, "Valor": 4450000}
]
datos

[{'Nombre': 'Jetta Variant',
  'Motor': 'Motor 4.0 Turbo',
  'Year': 2020,
  'Kilometraje': 44410.0,
  'Cero_km': False,
  'Valor': 120000},
 {'Nombre': 'Camaro',
  'Motor': 'Motor 4.54 LS',
  'Year': 2022,
  'Kilometraje': 12000.0,
  'Cero_km': False,
  'Valor': 480000},
 {'Nombre': 'Challenger',
  'Motor': 'Motor Turbo 4.3',
  'Year': 2025,
  'Kilometraje': 0.0,
  'Cero_km': True,
  'Valor': 680000},
 {'Nombre': 'Audio 8 spider',
  'Motor': 'Motor 8.0 Turbo',
  'Year': 2032,
  'Kilometraje': 0.0,
  'Cero_km': True,
  'Valor': 4450000}]

In [10]:
dataset = pd.DataFrame(datos)
dataset

           Nombre            Motor  Year  Kilometraje  Cero_km    Valor
0   Jetta Variant  Motor 4.0 Turbo  2020      44410.0    False   120000
1          Camaro    Motor 4.54 LS  2022      12000.0    False   480000
2      Challenger  Motor Turbo 4.3  2025          0.0     True   680000
3  Audio 8 spider  Motor 8.0 Turbo  2032          0.0     True  4450000

In [11]:
# Nombre de las columnas
dataset.columns.values

array(['Nombre', 'Motor', 'Year', 'Kilometraje', 'Cero_km', 'Valor'],
      dtype=object)

In [13]:
# Mostrar las primeras 3 columnas
dataset.columns.values[:4]

array(['Nombre', 'Motor', 'Year', 'Kilometraje'], dtype=object)

In [14]:
# Mostrar la última columna
dataset.columns.values[-1]

'Valor'

### Cambiar el orden en que se muestran las columnas

In [15]:
dataset[['Nombre', 'Valor', 'Motor', 'Year', 'Kilometraje', 'Cero_km']]

           Nombre    Valor            Motor  Year  Kilometraje  Cero_km
0   Jetta Variant   120000  Motor 4.0 Turbo  2020      44410.0    False
1          Camaro   480000    Motor 4.54 LS  2022      12000.0    False
2      Challenger   680000  Motor Turbo 4.3  2025          0.0     True
3  Audio 8 spider  4450000  Motor 8.0 Turbo  2032          0.0     True

### Cambiar el nombre de las columnas

In [16]:
dataset = dataset.rename(columns = {
    "Nombre": 'Name',
    "Motor": 'Engine',
    "Year": 'Year',
    "Kilometraje": 'Milage',
    "Cero_km": 'Zero_ml',
    "Valor": 'Price'
}
)
dataset

             Name           Engine  Year   Milage  Zero_ml    Price
0   Jetta Variant  Motor 4.0 Turbo  2020  44410.0    False   120000
1          Camaro    Motor 4.54 LS  2022  12000.0    False   480000
2      Challenger  Motor Turbo 4.3  2025      0.0     True   680000
3  Audio 8 spider  Motor 8.0 Turbo  2032      0.0     True  4450000

### Seleccionar columnas

In [19]:
dataset["Engine"]

0    Motor 4.0 Turbo
1      Motor 4.54 LS
2    Motor Turbo 4.3
3    Motor 8.0 Turbo
Name: Engine, dtype: object

In [22]:
dataset[["Name", "Price"]]

             Name    Price
0   Jetta Variant   120000
1          Camaro   480000
2      Challenger   680000
3  Audio 8 spider  4450000

### Mostrar las 2 filas

In [23]:
dataset.head(2)

            Name           Engine  Year   Milage  Zero_ml   Price
0  Jetta Variant  Motor 4.0 Turbo  2020  44410.0    False  120000
1         Camaro    Motor 4.54 LS  2022  12000.0    False  480000

### Ver las últimas filas

In [24]:
dataset.tail(2)

             Name           Engine  Year  Milage  Zero_ml    Price
2      Challenger  Motor Turbo 4.3  2025     0.0     True   680000
3  Audio 8 spider  Motor 8.0 Turbo  2032     0.0     True  4450000

### Obtner un resumen del dataset

In [25]:
dataset.describe()

              Year        Milage         Price
count     4.000000      4.000000  4.000000e+00
mean   2024.750000  14102.500000  1.432500e+06
std       5.251984  20981.945215  2.024967e+06
min    2020.000000      0.000000  1.200000e+05
25%    2021.500000      0.000000  3.900000e+05
50%    2023.500000   6000.000000  5.800000e+05
75%    2026.750000  20102.500000  1.622500e+06
max    2032.000000  44410.000000  4.450000e+06

### Seleccionar lineas (datos)

In [32]:
# Mostrar las primeras 2 filas
dataset[:2]

            Name           Engine  Year   Milage  Zero_ml   Price
0  Jetta Variant  Motor 4.0 Turbo  2020  44410.0    False  120000
1         Camaro    Motor 4.54 LS  2022  12000.0    False  480000

In [33]:
# Mostrar los 2 últimos
dataset[-2:]

             Name           Engine  Year  Milage  Zero_ml    Price
2      Challenger  Motor Turbo 4.3  2025     0.0     True   680000
3  Audio 8 spider  Motor 8.0 Turbo  2032     0.0     True  4450000

### Utilizar loc (.loc) para secciones

In [34]:
# Elemento con índice 3
dataset.loc[3]

Name        Audio 8 spider
Engine     Motor 8.0 Turbo
Year                  2032
Milage                 0.0
Zero_ml               True
Price              4450000
Name: 3, dtype: object

In [35]:
# Mostrar los elementos de los índices 1 y 2
dataset.loc[[1,2]]

         Name           Engine  Year   Milage  Zero_ml   Price
1      Camaro    Motor 4.54 LS  2022  12000.0    False  480000
2  Challenger  Motor Turbo 4.3  2025      0.0     True  680000

In [37]:
# Mostrar el nombre y el precio
dataset.loc[:, ['Name', 'Price']]

             Name    Price
0   Jetta Variant   120000
1          Camaro   480000
2      Challenger   680000
3  Audio 8 spider  4450000

In [38]:

dataset.loc[1:2 , ['Name', 'Price']]

         Name   Price
1      Camaro  480000
2  Challenger  680000